cask_args appdir: "/Applications"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "heroku/brew"
tap "aws/tap"
tap "leoafarias/fvm"

cask "google-chrome"
cask "box-drive"
cask "emacs"
cask "visual-studio-code"
cask "microsoft-office"
cask "microsoft-teams"
cask "zoom"
cask "alfred"
cask "typora"
cask "postman"
cask "drawio"
cask "font-jetbrains-mono"
cask "choosy"
cask "firefox"
cask "racket"
cask "azure-cli"
cask "discord"
cask "zulip"
cask "cljstyle"
cask "google-cloud-sdk"
cask "graphql-playground"
cask "mongodb-compass"
cask "docker"
cask "tigervnc-viewer"
brew "docker"

brew "asdf"
brew "tmux"
brew "jq"
brew "ag"
brew "jump"
brew "pure"
brew "mas"
brew "ghq"
brew "tree"
brew "bat"
brew "gpg"
brew "zplug"
brew "heroku"
brew "awscli"
brew "git"
brew "git-lfs"
brew "mysql-connector-c"
brew "shared-mime-info"
brew "yarn"
brew "hstr"
brew "gh"
brew "putty"
brew "llvm@12"
brew "weighttp"
brew "jupyterlab"
brew "httpei"
brew "flutter"
brew "android-studio"
brew "dotnet"
brew "sqlite"
brew "aws-sam-cli"
brew "bazelisk"
brew "shihanng/gig/gig"
brew "doxygen"
brew "sbcl"
brew "bison"
brew "krb5"
brew "libedit"
brew "libiconv"
brew "jpeg"
brew "libxml2"
brew "libzip"
brew "re2c"
brew "libpq"
brew "cabextract"
brew "clojure/tools/clojure"
brew "borkdude/brew/clj-kondo"
brew "leiningen"
brew "graphviz"
brew "roswell"
brew "ngrok/ngrok/ngrok"
brew "gradle"
brew "gettext"
brew "cmake"
brew "mvn"
brew "openapi-generator"
brew "kubectl"
brew "kind"
brew "fvm"
brew "rust-analyzer"
brew "direnv"
brew "ktlint"

mas "CyberDuck", id: 409222199
mas "Xcode ", id: 497799835
mas "feedly. Read more, know more.", id: 865500966
mas "GeoGebra Classic 6", id: 1182481622
